{"loss": "str", "optimizer": {"epsilon": 1e-08, "lr": 0.0010000000474974513, "name": "RMSprop", "rho": 0.8999999761581421}, "class_name": "Sequential", "keras_version": "1.0.3", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "output_dim": 100, "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dtype": "float32", "input_dim": 10, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "batch_input_shape": [null, 10]}}, {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 100}}, {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 100}}, {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_3"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 100}}, {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_4"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_5", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 100}}, {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_5"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_6", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 4}}, {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_6"}}], "sample_weight_mode": null}